const data = {
  morning: {
    title: "Подъём",
    text: "Умылся холодной водой, сделай зарядку, заправь кровать. \n Это даёт энергию на весь день.",
    text2:
      "Проснись, улыбнись новому дню и начни его с позитива! \n Хорошее утро - заряд энергии на весь день!",
    text3:
      "Хорошее утро - продуктивный день! \n Организованость - признак сильного человека!",
  },
  school: {
    title: "Школа",
    text: "Каждый урок — это новый уровень!  Ты узнаешь много нового, и это круто! Ты учишься мыслить и мечтать о будущем. \n В школе ты строишь фундамент для своих мечт и целей!",
    text2:
      "Старайся учиться с интересом, а не ради оценок. В школе ты получаешь базу, которая поможет тебе создавать крутые вещи в будущем.",
    text3: "Школа каждый день приближает тебя к мечте! \n Учись, задавай вопросы и будь любопытным — это ключ к успеху!",
  },
  food: {
    title: "Питание",
    text: "Вкусный обед — это не только приятно, но и важно для твоего здоровья!",
    text2:
      "Отдых нужен чтобы быть в ресурсе, а правильное питание — это топливо для твоего тела и мозга! ",
    text3:
      "Хорошая еда помогает тебе быть сильным и умным! \n Правильное питание — это инвестиция в твоё здоровье и успех!",
  },

  walk: {
    title: "🎯 Миссия",
    text: "Найди 3 интересные вещи: \nптицу, растение или насекомое. \n Попробуй понять, что это.",
    text2:
      "Сделай себе заметку о том, что тебе понравилось. \n Можешь зарисовать это или написать пару слов. \n Сделай фото и собери свой альбом природы!",
    text3:
      "Наблюдай за природой, слушай звуки и вдохновляйся красотой вокруг тебя!",
  },
  study: {
    title: "Дневник наблюдений",
    text: "Прочитай про то, что увидел. \n Стань исследователем!",
    text2: "Распечатай фото, которое ты сделал или дорисуй картинку.",
    text3:
      "Найди видео про то что ты сегодня наблюдай и узнай новые интересные факты! Создай свой каталог природы!",
  },
  games: {
    title: "Гаджеты",
    text: "Играй, но контролируй время. Контролируешь время ты — контролируешь свою жизнь! \n Не позволяй гаджетам отнимать у тебя время и энергию.",
    text2:
      "Выбирай полезный и интересный контент. \n Ищи игры, которые развивают твой мозг и творческие способности.",
    text3:
      "Гаджеты — это инструмент, а не цель. \n Используй их с умом, и они помогут тебе расти и развиваться!",
  },
  lego: {
  title: "LEGO / Проект",
  text: "Сегодня ты инженер 🔧 Придумай и собери что-то своё.",
  text2: "Не обязательно по инструкции — попробуй изменить или создать новое.",
  text3: "Настоящие изобретатели не боятся ошибок. Они пробуют снова и снова."
},
ideas: {
  title: "Дневник идей",
  text: "Запиши, что ты придумал сегодня 💡",
  text2: "Даже простая идея может стать чем-то большим.",
  text3: "Все великие изобретения начинались с маленькой мысли."
},
  sport: {
    title: "Спорт",
    text: "Учимся дисциплины, становимся сильнее и здоровее! ",
    text2:
      "Каждая тренировка — это шаг к твоей лучшей версии! \n Это шаг к победе над собой!",
    text3:
      "Сильное тело - сильный дух! \n Спорт - это не только здоровье, но и уверенность в себе!",
  },
  sportDom: {
    title: "Домашняя тренировка",
    text: "Это твоя секретная тренировка 🕶️ Здесь ты становишься сильнее без тренера — сам для себя!",
    text2:
      "Сделай 3 упражнения: растяжка, баланс, немного силы. \n Даже 10–15 минут делают тебя лучше!",
    text3:
      "Настоящая сила — когда ты тренируешься, даже если не хочется. \n Именно так становятся чемпионами!",
  },

  foodEvning: {
    title: "Ужин и отдых",
    text: "Еда — это топливо для твоего тела 💪 Чем лучше ты ешь, тем больше у тебя энергии.",
    text2: "Сильные и умные люди следят за тем, что они едят.",
    text3: "Поел — значит зарядился ⚡ Теперь ты готов стать ещё лучше!",
  },

  good: {
    title: "Доброе дело",
    text: "Помоги дома: убери, помоги мам, \n спроси чем ей помочь. \n Это делает тебя сильнее.",
    text2:
      "Полей цветы, вытери пыль, убери у себя на столе. \n Это не только поможет твоей семье, но и научит тебя ответственности.",
    text3:
      "Добрые дела делают тебя сильнее и лучше! \n Помогая другим, ты помогаешь себе стать лучшим человеком!",
  },
  lesson: {
    title: "Уроки",
    text: "Всего 15 минут ⏱️ Просто начни — это самое главное.",
    text2: "Сделай хотя бы чуть-чуть: одно задание или часть темы.",
    text3: "Дисциплина сегодня - свобода завтра! \n Учиться — это инвестиция в твоё будущее!",
  },
  video: {
  title: "Видео / мультик",
  text: "Посмотри видео 🎬 про изобритение, технику или научные открытия.",
  text2: "Смотри внимательно и попробуй понять: чему это тебя учит?",
  text3: "Вдохновление рождает большие идеи! 🚀"
},
  evning: {
  title: "Вечер и сон",
  text: "Время восстановиться 🌙 Твоё тело и мозг отдыхают и набираются сил.",
  text2: "Отложи гаджеты, расслабься и подумай: что сегодня было самым классным?",
  text3: "Крепкий сон - твой секрет роста и успеха! 🌟 💪"
},
};

const cards = document.querySelectorAll(".card");
const modal = document.getElementById("modal");
const title = document.getElementById("modal-title");
const text = document.getElementById("modal-text");
const text2 = document.getElementById("modal-text2");
const text3 = document.getElementById("modal-text3");
const close = document.querySelector(".close");

cards.forEach((card) => {
  card.addEventListener("click", () => {
    const id = card.dataset.id;
    if (!data[id]) return;

    title.innerText = data[id].title;
    text.innerText = data[id].text;
    text2.innerText = data[id].text2;
    text3.innerText = data[id].text3;

    modal.style.display = "block";
  });
});

close.onclick = () => (modal.style.display = "none");

window.onclick = (e) => {
  if (e.target == modal) modal.style.display = "none";
};
